; ModuleID = '/datadrive/llor/testsuite/exascale/miniAMR/stencil.in.ll'
source_filename = "stencil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ident_t = type { i32, i32, i32, i32, i8* }
%struct.block = type { i64, i64, i32, i32, i32, i32, i64, i32, i32, [6 x i32], [6 x i32], [6 x [2 x [2 x i32]]], [3 x i32], double**** }
%struct.sorted_block = type { i64, i32 }

@sorted_index = external dso_local global i32*, align 8
@num_refine = external dso_local global i32, align 4
@0 = private unnamed_addr constant [31 x i8] c";stencil.c;stencil_calc;84;7;;\00", align 1
@1 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([31 x i8], [31 x i8]* @0, i32 0, i32 0) }, align 8
@blocks = external dso_local global %struct.block*, align 8
@sorted_list = external dso_local global %struct.sorted_block*, align 8
@x_block_size = external dso_local global i32, align 4
@y_block_size = external dso_local global i32, align 4
@z_block_size = external dso_local global i32, align 4
@2 = private unnamed_addr constant [33 x i8] c";stencil.c;stencil_calc;84;127;;\00", align 1
@3 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([33 x i8], [33 x i8]* @2, i32 0, i32 0) }, align 8

!24 = distinct !DILexicalBlock(scope: !9, file: !1, line: 82, column: 8)
!25 = !DILocation(line: 82, column: 8, scope: !9)
!26 = !DILocation(line: 84, column: 7, scope: !27)
!27 = distinct !DILexicalBlock(scope: !24, file: !1, line: 82, column: 25)
!28 = !DILocation(line: 103, column: 33, scope: !27)
!29 = !DILocation(line: 103, column: 24, scope: !27)
!30 = !DILocation(line: 103, column: 44, scope: !27)
!31 = !DILocation(line: 103, column: 43, scope: !27)
!32 = !DILocation(line: 103, column: 21, scope: !27)
!33 = !DILocation(line: 104, column: 35, scope: !27)
!34 = !DILocation(line: 104, column: 34, scope: !27)
!35 = !DILocation(line: 104, column: 46, scope: !27)
!36 = !DILocation(line: 104, column: 45, scope: !27)
!37 = !DILocation(line: 104, column: 21, scope: !27)
!38 = !DILocation(line: 105, column: 4, scope: !27)
!39 = !DILocation(line: 107, column: 7, scope: !40)
!40 = distinct !DILexicalBlock(scope: !24, file: !1, line: 105, column: 11)
!41 = !DILocation(line: 148, column: 33, scope: !40)
!42 = !DILocation(line: 148, column: 24, scope: !40)
!43 = !DILocation(line: 148, column: 44, scope: !40)
!44 = !DILocation(line: 148, column: 43, scope: !40)
!45 = !DILocation(line: 148, column: 21, scope: !40)
!46 = !DILocation(line: 149, column: 36, scope: !40)
!47 = !DILocation(line: 149, column: 35, scope: !40)
!48 = !DILocation(line: 149, column: 47, scope: !40)
!49 = !DILocation(line: 149, column: 46, scope: !40)
!50 = !DILocation(line: 149, column: 21, scope: !40)
!51 = !DILocation(line: 151, column: 1, scope: !9)
!52 = distinct !DISubprogram(name: ".omp_outlined.", scope: !1, file: !1, line: 84, type: !53, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !55, !59, !59, !59, !59}
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!59 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12, size: 64)
!60 = !DILocalVariable(name: ".global_tid.", arg: 1, scope: !52, type: !55, flags: DIFlagArtificial)
!61 = !DILocation(line: 0, scope: !52)
!62 = !DILocalVariable(name: ".bound_tid.", arg: 2, scope: !52, type: !55, flags: DIFlagArtificial)
!63 = !DILocalVariable(name: "i", arg: 3, scope: !52, type: !59, flags: DIFlagArtificial)
!64 = !DILocalVariable(name: "j", arg: 4, scope: !52, type: !59, flags: DIFlagArtificial)
!65 = !DILocalVariable(name: "k", arg: 5, scope: !52, type: !59, flags: DIFlagArtificial)
!66 = !DILocalVariable(name: "var", arg: 6, scope: !52, type: !59, flags: DIFlagArtificial)
!67 = !{!68}
!68 = distinct !{!68, !69, !".omp_outlined._debug__: argument 0"}
!69 = distinct !{!69, !".omp_outlined._debug__"}
!70 = !DILocation(line: 84, column: 7, scope: !52)
!71 = !DILocation(line: 0, scope: !72, inlinedAt: !73)
!72 = distinct !DISubprogram(name: ".omp_outlined._debug__", scope: !1, file: !1, line: 85, type: !53, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!73 = distinct !DILocation(line: 84, column: 7, scope: !52)
!74 = !DILocalVariable(name: ".global_tid.", arg: 1, scope: !72, type: !55, flags: DIFlagArtificial)
!75 = !DILocalVariable(name: ".bound_tid.", arg: 2, scope: !72, type: !55, flags: DIFlagArtificial)
!76 = !DILocalVariable(name: "i", arg: 3, scope: !72, file: !1, line: 80, type: !59)
!77 = !DILocalVariable(name: "j", arg: 4, scope: !72, file: !1, line: 80, type: !59)
!78 = !DILocalVariable(name: "k", arg: 5, scope: !72, file: !1, line: 80, type: !59)
!79 = !DILocalVariable(name: "var", arg: 6, scope: !72, file: !1, line: 78, type: !59)
!80 = !DILocation(line: 85, column: 28, scope: !72, inlinedAt: !73)
!81 = !DILocation(line: 85, column: 41, scope: !72, inlinedAt: !73)
!82 = !DILocation(line: 85, column: 51, scope: !72, inlinedAt: !73)
!83 = !DILocalVariable(name: ".capture_expr.", scope: !72, type: !12, flags: DIFlagArtificial)
!84 = !DILocation(line: 85, column: 7, scope: !72, inlinedAt: !73)
!85 = !DILocalVariable(name: "in", scope: !72, type: !12, flags: DIFlagArtificial)
!86 = !DILocalVariable(name: ".omp.lb", scope: !72, type: !12, flags: DIFlagArtificial)
!87 = !DILocation(line: 85, column: 11, scope: !72, inlinedAt: !73)
!88 = !DILocalVariable(name: ".omp.ub", scope: !72, type: !12, flags: DIFlagArtificial)
!89 = !DILocalVariable(name: ".omp.stride", scope: !72, type: !12, flags: DIFlagArtificial)
!90 = !DILocalVariable(name: ".omp.is_last", scope: !72, type: !12, flags: DIFlagArtificial)
!91 = !DILocation(line: 84, column: 7, scope: !72, inlinedAt: !73)
!92 = !DILocalVariable(name: ".omp.iv", scope: !72, type: !12, flags: DIFlagArtificial)
!93 = !DILocation(line: 86, column: 23, scope: !94, inlinedAt: !73)
!94 = distinct !DILexicalBlock(scope: !72, file: !1, line: 85, column: 62)
!95 = !DILocation(line: 86, column: 30, scope: !94, inlinedAt: !73)
!96 = !DILocation(line: 86, column: 46, scope: !94, inlinedAt: !73)
!97 = !DILocalVariable(name: "bp", scope: !94, file: !1, line: 86, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !100, line: 53, baseType: !101)
!100 = !DIFile(filename: "./block.h", directory: "/datadrive/llor/testsuite/exascale/miniAMR")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 36, size: 1728, elements: !102)
!102 = !{!103, !106, !107, !108, !109, !110, !111, !112, !113, !114, !118, !119, !123, !127}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !101, file: !100, line: 37, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "num_sz", file: !100, line: 34, baseType: !105)
!105 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "num_prime", scope: !101, file: !100, line: 38, baseType: !104, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !101, file: !100, line: 39, baseType: !12, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !101, file: !100, line: 40, baseType: !12, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "new_proc", scope: !101, file: !100, line: 41, baseType: !12, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !101, file: !100, line: 42, baseType: !12, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !100, line: 43, baseType: !104, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !101, file: !100, line: 46, baseType: !12, size: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "child_number", scope: !101, file: !100, line: 47, baseType: !12, size: 32, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nei_refine", scope: !101, file: !100, line: 48, baseType: !115, size: 192, offset: 384)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 6)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nei_level", scope: !101, file: !100, line: 49, baseType: !115, size: 192, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nei", scope: !101, file: !100, line: 50, baseType: !120, size: 768, offset: 768)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !121)
!121 = !{!117, !122, !122}
!122 = !DISubrange(count: 2)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cen", scope: !101, file: !100, line: 51, baseType: !124, size: 96, offset: 1536)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 3)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !101, file: !100, line: 52, baseType: !128, size: 64, offset: 1664)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!132 = !DILocation(line: 0, scope: !94, inlinedAt: !73)
!133 = !DILocation(line: 87, column: 22, scope: !94, inlinedAt: !73)
!134 = !DILocation(line: 87, column: 34, scope: !94, inlinedAt: !73)
!135 = !DILocation(line: 87, column: 10, scope: !94, inlinedAt: !73)
!136 = !DILocation(line: 87, column: 38, scope: !94, inlinedAt: !73)
!137 = !DILocation(line: 87, column: 50, scope: !94, inlinedAt: !73)
!138 = !DILocation(line: 87, column: 54, scope: !94, inlinedAt: !73)
!139 = !DILocation(line: 87, column: 66, scope: !94, inlinedAt: !73)
!140 = !DILocalVariable(name: "__vla_expr0", scope: !94, type: !141, flags: DIFlagArtificial)
!141 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!142 = !DILocalVariable(name: "__vla_expr1", scope: !94, type: !141, flags: DIFlagArtificial)
!143 = !DILocalVariable(name: "__vla_expr2", scope: !94, type: !141, flags: DIFlagArtificial)
!144 = !DILocalVariable(name: "work", scope: !94, file: !1, line: 87, type: !145)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DISubrange(count: !140)
!148 = !DISubrange(count: !142)
!149 = !DISubrange(count: !143)
!150 = !DILocation(line: 87, column: 17, scope: !94, inlinedAt: !73)
!151 = !DILocation(line: 88, column: 17, scope: !152, inlinedAt: !73)
!152 = distinct !DILexicalBlock(scope: !94, file: !1, line: 88, column: 10)
!153 = !DILocation(line: 88, column: 15, scope: !152, inlinedAt: !73)
!154 = !DILocation(line: 88, column: 22, scope: !155, inlinedAt: !73)
!155 = distinct !DILexicalBlock(scope: !152, file: !1, line: 88, column: 10)
!156 = !DILocation(line: 88, column: 27, scope: !155, inlinedAt: !73)
!157 = !DILocation(line: 88, column: 24, scope: !155, inlinedAt: !73)
!158 = !DILocation(line: 88, column: 10, scope: !152, inlinedAt: !73)
!159 = !DILocation(line: 89, column: 20, scope: !160, inlinedAt: !73)
!160 = distinct !DILexicalBlock(scope: !155, file: !1, line: 89, column: 13)
!161 = !DILocation(line: 89, column: 18, scope: !160, inlinedAt: !73)
!162 = !DILocation(line: 89, column: 25, scope: !163, inlinedAt: !73)
!163 = distinct !DILexicalBlock(scope: !160, file: !1, line: 89, column: 13)
!164 = !DILocation(line: 89, column: 30, scope: !163, inlinedAt: !73)
!165 = !DILocation(line: 89, column: 27, scope: !163, inlinedAt: !73)
!166 = !DILocation(line: 89, column: 13, scope: !160, inlinedAt: !73)
!167 = !DILocation(line: 90, column: 23, scope: !168, inlinedAt: !73)
!168 = distinct !DILexicalBlock(scope: !163, file: !1, line: 90, column: 16)
!169 = !DILocation(line: 90, column: 21, scope: !168, inlinedAt: !73)
!170 = !DILocation(line: 90, column: 28, scope: !171, inlinedAt: !73)
!171 = distinct !DILexicalBlock(scope: !168, file: !1, line: 90, column: 16)
!172 = !DILocation(line: 90, column: 33, scope: !171, inlinedAt: !73)
!173 = !DILocation(line: 90, column: 30, scope: !171, inlinedAt: !73)
!174 = !DILocation(line: 90, column: 16, scope: !168, inlinedAt: !73)
!175 = !DILocation(line: 91, column: 40, scope: !171, inlinedAt: !73)
!176 = !DILocation(line: 91, column: 46, scope: !171, inlinedAt: !73)
!177 = !DILocation(line: 91, column: 36, scope: !171, inlinedAt: !73)
!178 = !DILocation(line: 91, column: 51, scope: !171, inlinedAt: !73)
!179 = !DILocation(line: 91, column: 52, scope: !171, inlinedAt: !73)
!180 = !DILocation(line: 91, column: 56, scope: !171, inlinedAt: !73)
!181 = !DILocation(line: 91, column: 61, scope: !171, inlinedAt: !73)
!182 = !DILocation(line: 92, column: 40, scope: !171, inlinedAt: !73)
