; ModuleID = '/datadrive/llor/testsuite/stencil.sb.ll'
source_filename = "stencil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ident_t = type { i32, i32, i32, i32, i8* }
%struct.block = type { i64, i64, i32, i32, i32, i32, i64, i32, i32, [6 x i32], [6 x i32], [6 x [2 x [2 x i32]]], [3 x i32], double**** }
%struct.sorted_block = type { i64, i32 }

@sorted_index = external dso_local global i32*, align 8
@num_refine = external dso_local global i32, align 4
@0 = private unnamed_addr constant [31 x i8] c";stencil.c;stencil_calc;84;7;;\00", align 1
@1 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([31 x i8], [31 x i8]* @0, i32 0, i32 0) }, align 8
@blocks = external dso_local global %struct.block*, align 8
@sorted_list = external dso_local global %struct.sorted_block*, align 8
@x_block_size = external dso_local global i32, align 4
@y_block_size = external dso_local global i32, align 4
@z_block_size = external dso_local global i32, align 4
@2 = private unnamed_addr constant [33 x i8] c";stencil.c;stencil_calc;84;127;;\00", align 1
@3 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([33 x i8], [33 x i8]* @2, i32 0, i32 0) }, align 8

!37 = !DILocation(line: 104, column: 35, scope: !27)
!38 = !{!"b544.barrier.false"}
!39 = !DILocation(line: 104, column: 34, scope: !27)
!40 = !DILocation(line: 104, column: 46, scope: !27)
!41 = !{!"b626.barrier.false"}
!42 = !DILocation(line: 104, column: 45, scope: !27)
!43 = !DILocation(line: 104, column: 21, scope: !27)
!44 = !{!"b749.barrier.false"}
!45 = !{!"b748.barrier.false"}
!46 = !DILocation(line: 105, column: 4, scope: !27)
!47 = !DILocation(line: 107, column: 7, scope: !48)
!48 = distinct !DILexicalBlock(scope: !24, file: !1, line: 105, column: 11)
!49 = !DILocation(line: 148, column: 33, scope: !48)
!50 = !{!"b543.barrier.false"}
!51 = !DILocation(line: 148, column: 24, scope: !48)
!52 = !DILocation(line: 148, column: 44, scope: !48)
!53 = !{!"b625.barrier.false"}
!54 = !DILocation(line: 148, column: 43, scope: !48)
!55 = !DILocation(line: 148, column: 21, scope: !48)
!56 = !{!"b683.barrier.false"}
!57 = !{!"b682.barrier.false"}
!58 = !DILocation(line: 149, column: 36, scope: !48)
!59 = !{!"b542.barrier.false"}
!60 = !DILocation(line: 149, column: 35, scope: !48)
!61 = !DILocation(line: 149, column: 47, scope: !48)
!62 = !{!"b624.barrier.false"}
!63 = !DILocation(line: 149, column: 46, scope: !48)
!64 = !DILocation(line: 149, column: 21, scope: !48)
!65 = !{!"b747.barrier.false"}
!66 = !{!"b746.barrier.false"}
!67 = !DILocation(line: 151, column: 1, scope: !9)
!68 = distinct !DISubprogram(name: ".omp_outlined.", scope: !1, file: !1, line: 84, type: !69, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !71, !75, !75, !75, !75}
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!75 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12, size: 64)
!76 = !DILocalVariable(name: ".global_tid.", arg: 1, scope: !68, type: !71, flags: DIFlagArtificial)
!77 = !DILocation(line: 0, scope: !68)
!78 = !DILocalVariable(name: ".bound_tid.", arg: 2, scope: !68, type: !71, flags: DIFlagArtificial)
!79 = !DILocalVariable(name: "i", arg: 3, scope: !68, type: !75, flags: DIFlagArtificial)
!80 = !DILocalVariable(name: "j", arg: 4, scope: !68, type: !75, flags: DIFlagArtificial)
!81 = !DILocalVariable(name: "k", arg: 5, scope: !68, type: !75, flags: DIFlagArtificial)
!82 = !DILocalVariable(name: "var", arg: 6, scope: !68, type: !75, flags: DIFlagArtificial)
!83 = !{!84}
!84 = distinct !{!84, !85, !".omp_outlined._debug__: argument 0"}
!85 = distinct !{!85, !".omp_outlined._debug__"}
!86 = !DILocation(line: 84, column: 7, scope: !68)
!87 = !DILocation(line: 0, scope: !88, inlinedAt: !89)
!88 = distinct !DISubprogram(name: ".omp_outlined._debug__", scope: !1, file: !1, line: 85, type: !69, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!89 = distinct !DILocation(line: 84, column: 7, scope: !68)
!90 = !DILocalVariable(name: ".global_tid.", arg: 1, scope: !88, type: !71, flags: DIFlagArtificial)
!91 = !DILocalVariable(name: ".bound_tid.", arg: 2, scope: !88, type: !71, flags: DIFlagArtificial)
!92 = !DILocalVariable(name: "i", arg: 3, scope: !88, file: !1, line: 80, type: !75)
!93 = !DILocalVariable(name: "j", arg: 4, scope: !88, file: !1, line: 80, type: !75)
!94 = !DILocalVariable(name: "k", arg: 5, scope: !88, file: !1, line: 80, type: !75)
!95 = !DILocalVariable(name: "var", arg: 6, scope: !88, file: !1, line: 78, type: !75)
!96 = !DILocation(line: 85, column: 28, scope: !88, inlinedAt: !89)
!97 = !{!"b235.barrier.false"}
!98 = !DILocation(line: 85, column: 41, scope: !88, inlinedAt: !89)
!99 = !{!"b266.barrier.false"}
!100 = !DILocation(line: 85, column: 51, scope: !88, inlinedAt: !89)
!101 = !DILocalVariable(name: ".capture_expr.", scope: !88, type: !12, flags: DIFlagArtificial)
!102 = !DILocation(line: 85, column: 7, scope: !88, inlinedAt: !89)
!103 = !DILocalVariable(name: "in", scope: !88, type: !12, flags: DIFlagArtificial)
!104 = !DILocalVariable(name: ".omp.lb", scope: !88, type: !12, flags: DIFlagArtificial)
!105 = !DILocation(line: 85, column: 11, scope: !88, inlinedAt: !89)
!106 = !DILocalVariable(name: ".omp.ub", scope: !88, type: !12, flags: DIFlagArtificial)
!107 = !DILocalVariable(name: ".omp.stride", scope: !88, type: !12, flags: DIFlagArtificial)
!108 = !DILocalVariable(name: ".omp.is_last", scope: !88, type: !12, flags: DIFlagArtificial)
!109 = !DILocation(line: 84, column: 7, scope: !88, inlinedAt: !89)
!110 = !DILocalVariable(name: ".omp.iv", scope: !88, type: !12, flags: DIFlagArtificial)
!111 = !DILocation(line: 86, column: 23, scope: !112, inlinedAt: !89)
!112 = distinct !DILexicalBlock(scope: !88, file: !1, line: 85, column: 62)
!113 = !{!"b297.ordered.false"}
!114 = !DILocation(line: 86, column: 30, scope: !112, inlinedAt: !89)
!115 = !{!"b328.ordered.false"}
!116 = !DILocation(line: 86, column: 46, scope: !112, inlinedAt: !89)
!117 = !DILocalVariable(name: "bp", scope: !112, file: !1, line: 86, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !120, line: 53, baseType: !121)
!120 = !DIFile(filename: "./block.h", directory: "/datadrive/llor/testsuite/exascale/miniAMR")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 36, size: 1728, elements: !122)
!122 = !{!123, !126, !127, !128, !129, !130, !131, !132, !133, !134, !138, !139, !143, !147}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !121, file: !120, line: 37, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "num_sz", file: !120, line: 34, baseType: !125)
!125 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "num_prime", scope: !121, file: !120, line: 38, baseType: !124, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !121, file: !120, line: 39, baseType: !12, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !121, file: !120, line: 40, baseType: !12, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "new_proc", scope: !121, file: !120, line: 41, baseType: !12, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !121, file: !120, line: 42, baseType: !12, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !120, line: 43, baseType: !124, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent_node", scope: !121, file: !120, line: 46, baseType: !12, size: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "child_number", scope: !121, file: !120, line: 47, baseType: !12, size: 32, offset: 352)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nei_refine", scope: !121, file: !120, line: 48, baseType: !135, size: 192, offset: 384)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 6)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nei_level", scope: !121, file: !120, line: 49, baseType: !135, size: 192, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nei", scope: !121, file: !120, line: 50, baseType: !140, size: 768, offset: 768)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !141)
!141 = !{!137, !142, !142}
!142 = !DISubrange(count: 2)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cen", scope: !121, file: !120, line: 51, baseType: !144, size: 96, offset: 1536)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !121, file: !120, line: 52, baseType: !148, size: 64, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!152 = !DILocation(line: 0, scope: !112, inlinedAt: !89)
!153 = !DILocation(line: 87, column: 22, scope: !112, inlinedAt: !89)
!154 = !{!"b373.ordered.false"}
!155 = !DILocation(line: 87, column: 34, scope: !112, inlinedAt: !89)
!156 = !DILocation(line: 87, column: 10, scope: !112, inlinedAt: !89)
!157 = !DILocation(line: 87, column: 38, scope: !112, inlinedAt: !89)
!158 = !{!"b418.ordered.false"}
!159 = !DILocation(line: 87, column: 50, scope: !112, inlinedAt: !89)
!160 = !DILocation(line: 87, column: 54, scope: !112, inlinedAt: !89)
!161 = !{!"b463.ordered.false"}
!162 = !DILocation(line: 87, column: 66, scope: !112, inlinedAt: !89)
!163 = !DILocalVariable(name: "__vla_expr0", scope: !112, type: !164, flags: DIFlagArtificial)
!164 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!165 = !DILocalVariable(name: "__vla_expr1", scope: !112, type: !164, flags: DIFlagArtificial)
!166 = !DILocalVariable(name: "__vla_expr2", scope: !112, type: !164, flags: DIFlagArtificial)
!167 = !DILocalVariable(name: "work", scope: !112, file: !1, line: 87, type: !168)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DISubrange(count: !163)
!171 = !DISubrange(count: !165)
!172 = !DISubrange(count: !166)
!173 = !DILocation(line: 87, column: 17, scope: !112, inlinedAt: !89)
!174 = !DILocation(line: 88, column: 17, scope: !175, inlinedAt: !89)
!175 = distinct !DILexicalBlock(scope: !112, file: !1, line: 88, column: 10)
!176 = !{!"b18.ordered.false"}
!177 = !DILocation(line: 88, column: 15, scope: !175, inlinedAt: !89)
!178 = !DILocation(line: 88, column: 22, scope: !179, inlinedAt: !89)
!179 = distinct !DILexicalBlock(scope: !175, file: !1, line: 88, column: 10)
!180 = !{!"b17.ordered.false"}
!181 = !DILocation(line: 88, column: 27, scope: !179, inlinedAt: !89)
!182 = !{!"b372.ordered.false"}
!183 = !DILocation(line: 88, column: 24, scope: !179, inlinedAt: !89)
!184 = !DILocation(line: 88, column: 10, scope: !175, inlinedAt: !89)
!185 = !DILocation(line: 89, column: 20, scope: !186, inlinedAt: !89)
!186 = distinct !DILexicalBlock(scope: !179, file: !1, line: 89, column: 13)
!187 = !{!"b36.ordered.false"}
!188 = !DILocation(line: 89, column: 18, scope: !186, inlinedAt: !89)
!189 = !DILocation(line: 89, column: 25, scope: !190, inlinedAt: !89)
!190 = distinct !DILexicalBlock(scope: !186, file: !1, line: 89, column: 13)
!191 = !{!"b35.ordered.false"}
!192 = !DILocation(line: 89, column: 30, scope: !190, inlinedAt: !89)
!193 = !{!"b417.ordered.false"}
!194 = !DILocation(line: 89, column: 27, scope: !190, inlinedAt: !89)
!195 = !DILocation(line: 89, column: 13, scope: !186, inlinedAt: !89)
!196 = !DILocation(line: 90, column: 23, scope: !197, inlinedAt: !89)
!197 = distinct !DILexicalBlock(scope: !190, file: !1, line: 90, column: 16)
!198 = !{!"b54.ordered.false"}
!199 = !DILocation(line: 90, column: 21, scope: !197, inlinedAt: !89)
!200 = !DILocation(line: 90, column: 28, scope: !201, inlinedAt: !89)
!201 = distinct !DILexicalBlock(scope: !197, file: !1, line: 90, column: 16)
!202 = !{!"b53.ordered.false"}
!203 = !DILocation(line: 90, column: 33, scope: !201, inlinedAt: !89)
!204 = !{!"b462.ordered.false"}
!205 = !DILocation(line: 90, column: 30, scope: !201, inlinedAt: !89)
!206 = !DILocation(line: 90, column: 16, scope: !197, inlinedAt: !89)
!207 = !DILocation(line: 91, column: 40, scope: !201, inlinedAt: !89)
!208 = !DILocation(line: 91, column: 46, scope: !201, inlinedAt: !89)
!209 = !{!"b62.ordered.false"}
